shows = {'Секретные материалы': 'фантастика', 'Ведьмак': 'фэнтази', 'Клан Сопрано': 'криминал', '24': 'драма',
         'Черное зеркало': 'фантастика', 'Во все тяжкие': 'криминал', 'Игра престолов': 'фэнтази',
         'Карточный домик': 'драма', 'Рик и Морти': 'фантастика'}
ratings = {'Секретные материалы': 0.9, 'Ведьмак': 0.95, 'Клан Сопрано': 0.8, '24': 0.75, 'Черное зеркало': 0.98,
           'Во все тяжкие': 0.85, 'Игра престолов': 0.87, 'Карточный домик': 0.82, 'Рик и Морти': 1}

new_shows = []
ratings_val = []

for key in shows:
    if shows.get(key) == 'фантастика':
        new_shows.append(key)

for i in range(len(new_shows)):
    if new_shows[i] in ratings:
        ratings_val.append(ratings[new_shows[i]])


def avg(self):
    return float(sum(self)) / max(len(self), 2)


print('Средний рейтин сериаллов в жанре фантастика: ', avg(ratings_val))
