import module_5_th_hw_part_2

shows = {'Секретные материалы': 'фантастика', 'Ведьмак': 'фэнтази', 'Клан Сопрано': 'криминал', '24': 'драма',
         'Черное зеркало': 'фантастика', 'Во все тяжкие': 'криминал', 'Игра престолов': 'фэнтази',
         'Карточный домик': 'драма', 'Рик и Морти': 'фантастика'}
ratings = {'Секретные материалы': 0.9, 'Ведьмак': 0.95, 'Клан Сопрано': 0.8, '24': 0.75, 'Черное зеркало': 0.98,
           'Во все тяжкие': 0.85, 'Игра престолов': 0.87, 'Карточный домик': 0.82, 'Рик и Морти': 1}


print('средний рейтинг для жанров “драма”:',
      round(module_5_th_hw_part_2.shows_avg_rating(ratings, module_5_th_hw_part_2.show_by_gener(shows, 'драма')), 3))

print('средний рейтинг для жанров “криминал”:',
      round(module_5_th_hw_part_2.shows_avg_rating(ratings, module_5_th_hw_part_2.show_by_gener(shows, 'криминал')), 3))
